apache/nuttx/arch/mips/src/pic32mx/pic32mx_usbdev.c
  struct usbdev_ep_s       ep;               /* Standard endpoint structure */

  /* PIC32MX-specific fields */

  struct pic32mx_usbdev_s *dev;              /* Reference to private driver data */
  struct pic32mx_queue_s   pend;             /* List of pending (inactive) requests for this endpoint */
  struct pic32mx_queue_s   active;           /* List of active requests for this endpoint */
  uint8_t                  stalled:1;        /* true: Endpoint is stalled */
  uint8_t                  halted:1;         /* true: Endpoint feature halted */
  uint8_t                  txnullpkt:1;      /* Null packet needed at end of TX transfer */
  uint8_t                  txdata1:1;        /* Data0/1 of next TX transfer */
  uint8_t                  rxdata1:1;        /* Data0/1 of next RX transfer */
  volatile struct usbotg_bdtentry_s *bdtin;  /* BDT entry for the IN transaction */
  volatile struct usbotg_bdtentry_s *bdtout; /* BDT entry for the OUT transaction */
};

struct pic32mx_usbdev_s
{
  /* Common device fields.  This must be the first thing defined in the
   * structure so that it is possible to simply cast from struct usbdev_s
   * to structpic32mx_usbdev_s.
   */

  struct usbdev_s usbdev;

  /* The bound device class driver */

  struct usbdevclass_driver_s *driver;

  /* PIC32MX-specific fields */

  struct usb_ctrlreq_s     ctrl;          /* Last EP0 request */
  uint8_t                  devstate;      /* Driver state (see enum pic32mx_devstate_e) */
  uint8_t                  ctrlstate;     /* Control EP state (see enum pic32mx_ctrlstate_e) */
  uint8_t                  selfpowered:1; /* 1: Device is self powered */
  uint8_t                  rwakeup:1;     /* 1: Device supports remote wakeup */
  uint8_t                  attached:1;    /* Device is attached to the host */
  uint8_t                  ep0done:1;     /* EP0 OUT already prepared */
  uint8_t                  rxbusy:1;      /* EP0 OUT data transfer in progress */
  uint16_t                 epavail;       /* Bitset of available endpoints */
  uint16_t                 epstalled;     /* Bitset of stalled endpoints */
  struct wdog_s            wdog;          /* Supports the restart delay */

  /* The endpoint list */

  struct pic32mx_ep_s      eplist[PIC32MX_NENDPOINTS];
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Register operations ******************************************************/

#ifdef CONFIG_PIC32MX_USBDEV_REGDEBUG
static uint16_t pic32mx_getreg(uint32_t addr);
static void pic32mx_putreg(uint16_t val, uint32_t addr);
#endif

/* Suspend/Resume Helpers ***************************************************/

static void pic32mx_suspend(struct pic32mx_usbdev_s *priv);
static void pic32mx_resume(struct pic32mx_usbdev_s *priv);

/* Request Queue Management *************************************************/

static struct pic32mx_req_s *pic32mx_remfirst(struct pic32mx_queue_s *queue);
static struct pic32mx_req_s *pic32mx_remlast(struct pic32mx_queue_s *queue);
static void pic32mx_addlast(struct pic32mx_queue_s *queue,
                struct pic32mx_req_s *req);
static void pic32mx_addfirst(struct pic32mx_queue_s *queue,
                 struct pic32mx_req_s *req);

/* Request Helpers **********************************************************/

static void pic32mx_reqreturn(struct pic32mx_ep_s *privep,
                struct pic32mx_req_s *privreq, int16_t result);
static void pic32mx_reqcomplete(struct pic32mx_ep_s *privep,
                int16_t result);
static void pic32mx_epwrite(struct pic32mx_ep_s *privep,
                volatile struct usbotg_bdtentry_s *bdt,
                const uint8_t *src, uint32_t nbytes);
static void pic32mx_wrcomplete(struct pic32mx_usbdev_s *priv,
                struct pic32mx_ep_s *privep);
static void pic32mx_rqrestart(wdparm_t arg);
static void pic32mx_delayedrestart(struct pic32mx_usbdev_s *priv,
                uint8_t epno);
static void pic32mx_rqstop(struct pic32mx_ep_s *privep);
static int  pic32mx_wrstart(struct pic32mx_usbdev_s *priv,
                struct pic32mx_ep_s *privep);
static int  pic32mx_wrrequest(struct pic32mx_usbdev_s *priv,
                struct pic32mx_ep_s *privep);
static int  pic32mx_rdcomplete(struct pic32mx_usbdev_s *priv,
                struct pic32mx_ep_s *privep);
static int  pic32mx_ep0rdsetup(struct pic32mx_usbdev_s *priv,
                uint8_t *dest, int readlen);
static int  pic32mx_rdsetup(struct pic32mx_ep_s *privep, uint8_t *dest,
                int readlen);
static int  pic32mx_rdrequest(struct pic32mx_usbdev_s *priv,
                struct pic32mx_ep_s *privep);
static void pic32mx_cancelrequests(struct pic32mx_ep_s *privep,
                int16_t result);

/* Interrupt level processing ***********************************************/

static void pic32mx_dispatchrequest(struct pic32mx_usbdev_s *priv);
static void pic32mx_ep0stall(struct pic32mx_usbdev_s *priv);
static void pic32mx_eptransfer(struct pic32mx_usbdev_s *priv, uint8_t epno,
                uint16_t ustat);
static void pic32mx_ep0nextsetup(struct pic32mx_usbdev_s *priv);
static void pic32mx_ep0rdcomplete(struct pic32mx_usbdev_s *priv);
static void pic32mx_ep0setup(struct pic32mx_usbdev_s *priv);
static void pic32mx_ep0outcomplete(struct pic32mx_usbdev_s *priv);
static void pic32mx_ep0incomplete(struct pic32mx_usbdev_s *priv);
static void pic32mx_ep0transfer(struct pic32mx_usbdev_s *priv,
                uint16_t ustat);
static int  pic32mx_interrupt(int irq, void *context, void *arg);

/* Endpoint helpers *********************************************************/

static inline struct pic32mx_ep_s *
            pic32mx_epreserve(struct pic32mx_usbdev_s *priv, uint8_t epset);
static inline void
            pic32mx_epunreserve(struct pic32mx_usbdev_s *priv,
                struct pic32mx_ep_s *privep);
static void pic32mx_ep0configure(struct pic32mx_usbdev_s *priv);

/* Endpoint operations ******************************************************/

static int  pic32mx_epconfigure(struct usbdev_ep_s *ep,
                const struct usb_epdesc_s *desc, bool last);
static int  pic32mx_epdisable(struct usbdev_ep_s *ep);
static struct usbdev_req_s *
            pic32mx_epallocreq(struct usbdev_ep_s *ep);
static void pic32mx_epfreereq(struct usbdev_ep_s *ep,
                struct usbdev_req_s *);
static int  pic32mx_epsubmit(struct usbdev_ep_s *ep,
                struct usbdev_req_s *req);
static int  pic32mx_epcancel(struct usbdev_ep_s *ep,
                struct usbdev_req_s *req);
static int  pic32mx_epbdtstall(struct usbdev_ep_s *ep, bool resume,
                bool epin);
static int  pic32mx_epstall(struct usbdev_ep_s *ep, bool resume);

/* USB device controller operations *****************************************/

static struct usbdev_ep_s *
            pic32mx_allocep(struct usbdev_s *dev, uint8_t epno, bool in,
                uint8_t eptype);
static void pic32mx_freeep(struct usbdev_s *dev, struct usbdev_ep_s *ep);
static int  pic32mx_getframe(struct usbdev_s *dev);
static int  pic32mx_wakeup(struct usbdev_s *dev);
static int  pic32mx_selfpowered(struct usbdev_s *dev, bool selfpowered);

